
// Здесь короч создается шаблон
<template>
  <div id='app'>
    <!-- Тут мы бум передавать параметр из 
    компонента -->
    <p>{{ message }}</p>
  </div>
</template>

<script>
  // тут тип сам компонент
  export default {
    // мы тип экспортируем вот эту всю штуку
    // что тут перечислена
    // в data на самом деле можно перечислять
    // просто те переменные которые 
    // мы отправим в шаблон
    // вот так
    // data : {
    // имя_переменной: значение переменной
    // }
    // А в данном случае
    // В шаблон отправится такой же объект
    // Что и в примере выше
    // Но просто этот объект вернет функция
    // Переменные кстати могут быть равны функциям
    // Просто в функции нужно делать возврат
    // того чего нам нужно в переменной
    data: function () {
      return {
        message: ""
      }
    }
  }
</script>

<style scoped>
  /* а тут мы описываем те стили которые 
  нужны нашему шаблону */
  /* на самом деле очень удобно, что
  бы не засорять общий файл css
  и не рыскать там в поисках нужных стилей
  . Единственное, нужно внимательно следить
  за адаптивностью (медиа запросы), что бы
  была поддержка всех тех которые 
  есть в основном файле (конечно по
  необходимости) */
  p {
    font-size: 2em;
    text-align: center;
  }
</style>